public class Z1Tools {

    public static void printArray(A2Products[] arr) {
        for (int i = 0; i < arr.length; i++) {
            System.out.println(arr[i]);
        }
    }
       /*Допустим, вы пишите программу для магазина. В вашем магазине продают продукты,
     одежду и электронику. Каждый товар в магазине имеет название, цену и артикул.
     При покупке продуктов покупателю предоставляется скидка 30%, если до истечения срока годности остается меньше 2 дней
     (количество дней до истечения срока можно хранить в поле int).
     При покупки электроники, оформляется гарантия т.е. должен быть вызван соответствующий метод.
     При покупки телефонов, кроме гарантии оформляется и контракт с GMBH Telecom, что увеличивает стоимость на 50 евро Естественно,
      каждый товар можно купить (на экране должна распечататься стоимость товара, стоимость доп. услуг, итоговая стоимость).
      Реализовать структуру классов для данной программы.
*/


        /*
        вот тут можно было методовнаписать и в майне вызывать
      НО ПОЧЕМУТО ГЕТОРЫ И СЭТОРЫ НЕ ВИДЕТЬ, ХОТЯ Я ИХ ПРОПИСАЛ, НО НЕ A2PRODUCTS
      А НАЗВАНИЯ Я ТАК НАЗВАЛ ПОТОМУ ЧТО МНЕ БЫСТРЕЕ  ОРЕИТИРОВАТЬСЯ, И СОРТИРУЕТЬСЯ ПО ЭРРАХИИ
      ЕЩЁ МОЖНО БЫЛО БЫ MAIN НА A1MAIN НАЗВАТЬ
      А Z1TOOLS  Я ХОТЕЛ СДЕЛАТЬ СКИДКИ МЕТАДАМИ, ЧТОБ ИХ К РАЗЛИЧНЫМ МАССИВАМ ПРИМЕНЯТЬ

       ПЛЮС У МЕНЯ НЕ ВЫШЛО МАИН ОСВОБОДИТЬ, ТИПО ВСЕ МАССИВЫ В A2PRODUCTS ЗАДАТЬ, НО ТАМ НЕ ВИДНО МЕТОДОВ Z1TOOLS
       ТОЖЕ НЕ ПОЙМУ ПОЧЕМУ

      ВЫВОД УЧИТЬСЯ УЧИТЬСЯ И УЧИТЬСЯ

         */

}